arduino/portentax8-stm32h7-fw/src/crc32.c
/*
 * Firmware for the Portenta X8 STM32H747AIIX/Cortex-M7 core.
 * Copyright (C) 2022 Arduino (http://www.arduino.cc/)
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

/**************************************************************************************
 * INCLUDE
 **************************************************************************************/

#include "crc32.h"

#include "stm32h7xx_hal.h"

/**************************************************************************************
 * GLOBAL VARIABLES
 **************************************************************************************/

CRC_HandleTypeDef crc_hdl;

/**************************************************************************************
 * FUNCTION DEFINITION
 **************************************************************************************/

bool crc32_init()
{
  crc_hdl.Instance                     = CRC;

  crc_hdl.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
  crc_hdl.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
  crc_hdl.Init.CRCLength               = CRC_POLYLENGTH_32B;
  crc_hdl.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
  crc_hdl.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;

  crc_hdl.InputDataFormat              = CRC_INPUTDATA_FORMAT_BYTES;

  return (HAL_OK == HAL_CRC_Init(&crc_hdl));
}

uint32_t crc32_compute(uint8_t const * buf, uint32_t const buf_size)
{
  return HAL_CRC_Calculate(&crc_hdl, (uint32_t *)buf, buf_size);
}

void HAL_CRC_MspInit(CRC_HandleTypeDef * hcrc)
{
  if(hcrc->Instance == CRC)
    __HAL_RCC_CRC_CLK_ENABLE();
}

void HAL_CRC_MspDeInit(CRC_HandleTypeDef * hcrc)
{
  if(hcrc->Instance == CRC)
    __HAL_RCC_CRC_CLK_DISABLE();
}
